
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)  
	Если МенеджерЗаказов.ЕстьЗаказВРаботе(МенеджерКурьеров.ПолучитьКурьера()) Тогда
		Сообщить("Завершите текущую доставку, прежде чем брать в работу новые!");	
	Иначе 
		Если МенеджерКурьеров.ПолучитьСтатусКурьера() = ПредопределенноеЗначение("Перечисление.СтатусыГотовностиКурьеровКРаботе.НеГотов") Тогда
			Сообщить("Вы указали, что не готовы к работе. Измените статус готовности к работе");	
		Иначе
			ОткрытьФорму("Документ.Заказ.Форма.КурьерскаяФормаСпискаДляЗаявок"); 
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры   
