
&НаКлиенте
Процедура ПриоритетныеМагазиныПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Объект.ПриоритетныеМагазины.Количество() >= 2 Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если МагазиныПовторяются() Тогда
		Сообщить("Выбранные магазины не должны повторяться");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры


&НаСервере 
Функция МагазиныПовторяются()
	ДокументОбъект = РеквизитФормыВЗначение("Объект"); 
	Возврат ДокументОбъект.КоличествоУникальныхМагазинов() <> ДокументОбъект.КоличествоМагазинов()
	//ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");		
КонецФункции

