
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды) 
	КурьерСсылка = МенеджерКурьеров.ПолучитьКурьера();
	Если МенеджерЗаказов.ЕстьЗаказВРаботе(КурьерСсылка) Тогда
		ЗаказСсылка = МенеджерЗаказов.ПолучитьТекущийЗаказ(КурьерСсылка);
		ПараметрыФормы = Новый Структура("Ключ", ЗаказСсылка);
		ОткрытьФорму("Документ.Заказ.Форма.КурьерскаяФормаДокумента", ПараметрыФормы);		
	Иначе
		Сообщить("У вас пока нет заказа в работе. Взять заказ можно в Заявках На Доставку");	
	КонецЕсли;
КонецПроцедуры   
