
&НаКлиенте
Процедура ОтменитьЗаказ(Команда)
	ОтменитьЗаказНаСервере();	
	Закрыть();
КонецПроцедуры


&НаСервере
Процедура ОтменитьЗаказНаСервере()   
	Объект.Состояние = Перечисления.СтадииДоставкиЗаказа.Отменен;
	ЭтаФорма.Записать();
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.Элементы.ОтменитьЗаказ.Видимость = НЕ ЭтотЗаказЗавершен();	        
КонецПроцедуры 
  
&НаКлиенте
Функция ЭтотЗаказЗавершен()
 	Возврат Объект.Состояние = ПредопределенноеЗначение("Перечисление.СтадииДоставкиЗаказа.Доставлен") 
		ИЛИ Объект.Состояние = ПредопределенноеЗначение("Перечисление.СтадииДоставкиЗаказа.Отменен");	
КонецФункции



