
&НаКлиенте
Процедура НеБеру(Команда)
	ОтклонитьНаСервере();    
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ОтклонитьНаСервере()
	МенеджерЗаписи = РегистрыСведений.ПодборКурьераКЗаказу.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Заказ = Объект.Ссылка;
	МенеджерЗаписи.Курьер = МенеджерКурьеров.ПолучитьКурьера();
	МенеджерЗаписи.ОтветКурьера = Перечисления.СтатусыПодбораКурьераКЗаказу.НеБеру;
	МенеджерЗаписи.Записать(); 	
КонецПроцедуры


&НаКлиенте
Процедура БеруВРаботу(Команда)
	ПринятьНаСервере(); 
	Закрыть();
КонецПроцедуры    

&НаСервере
Процедура ПринятьНаСервере()   
	Курьер = МенеджерКурьеров.ПолучитьКурьера();
	МенеджерЗаписи = РегистрыСведений.ПодборКурьераКЗаказу.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Заказ = Объект.Ссылка;
	МенеджерЗаписи.Курьер = Курьер;
	МенеджерЗаписи.ОтветКурьера = Перечисления.СтатусыПодбораКурьераКЗаказу.БеруВРаботу;
	МенеджерЗаписи.Записать(); 	
	Объект.Курьер = Курьер; 
	Объект.Состояние = Перечисления.СтадииДоставкиЗаказа.Начат;
	ЭтаФорма.Записать();
КонецПроцедуры

