
&НаКлиенте
Процедура ПодтвердитьДоставку(Команда)    
	Если Объект.Состояние = ПредопределенноеЗначение("Перечисление.СтадииДоставкиЗаказа.Начат") ИЛИ
		Объект.Состояние = ПредопределенноеЗначение("Перечисление.СтадииДоставкиЗаказа.Задерживается") Тогда
		ЗабратьЗаказИзМагазинаНаСервере(); 	
		Иначе Если Объект.Состояние = ПредопределенноеЗначение("Перечисление.СтадииДоставкиЗаказа.Доставляется") Тогда
			ДоставитьЗаказНаСервере();	
		КонецЕсли;
	КонецЕсли;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьДоставку(Команда)    
	ОтменитьЗаказНаСервере();	
	Закрыть();
КонецПроцедуры



&НаСервере
Процедура ДоставитьЗаказНаСервере()   
	Объект.Состояние = Перечисления.СтадииДоставкиЗаказа.Доставлен;
	ЭтаФорма.Записать();
КонецПроцедуры  

&НаСервере
Процедура ЗабратьЗаказИзМагазинаНаСервере()   
	Объект.Состояние = Перечисления.СтадииДоставкиЗаказа.Доставляется;
	ЭтаФорма.Записать();
КонецПроцедуры

&НаСервере
Процедура ОтменитьЗаказНаСервере()   
	Объект.Состояние = Перечисления.СтадииДоставкиЗаказа.Отменен;
	ЭтаФорма.Записать();
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.Состояние = ПредопределенноеЗначение("Перечисление.СтадииДоставкиЗаказа.Начат") ИЛИ
		Объект.Состояние = ПредопределенноеЗначение("Перечисление.СтадииДоставкиЗаказа.Задерживается") Тогда
		ЭтаФорма.Элементы.ПодтвердитьДоставку.Заголовок = "Забрал из магазина";			
	КонецЕсли;   
	Если Объект.Состояние = ПредопределенноеЗначение("Перечисление.СтадииДоставкиЗаказа.Доставляется") Тогда
		ЭтаФорма.Элементы.ПодтвердитьДоставку.Заголовок = "Доставил клиенту";		
	КонецЕсли;		
КонецПроцедуры 



