
&НаКлиенте
Процедура ДоставилКлиенту(Команда)  
	ДоставитьЗаказНаСервере();
	Закрыть();
КонецПроцедуры  

&НаКлиенте
Процедура ЗабралИзМагазина(Команда) 
	ЗабратьЗаказИзМагазинаНаСервере();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьДоставку(Команда)    
	ОтменитьЗаказНаСервере();	
	Закрыть();
КонецПроцедуры


&НаСервере
Процедура ДоставитьЗаказНаСервере()   
	Объект.Состояние = Перечисления.СтадииДоставкиЗаказа.Доставлен;
	ЭтаФорма.Записать();
КонецПроцедуры  

&НаСервере
Процедура ЗабратьЗаказИзМагазинаНаСервере()   
	Объект.Состояние = Перечисления.СтадииДоставкиЗаказа.Доставляется;
	ЭтаФорма.Записать();
КонецПроцедуры

&НаСервере
Процедура ОтменитьЗаказНаСервере()   
	Объект.Состояние = Перечисления.СтадииДоставкиЗаказа.Отменен;
	ЭтаФорма.Записать();
КонецПроцедуры

