Функция ЕстьЗаказВРаботе(Курьер) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Заказы.Ссылка КАК Ссылка,
		|	Заказы.ВерсияДанных КАК ВерсияДанных,
		|	Заказы.ПометкаУдаления КАК ПометкаУдаления,
		|	Заказы.Номер КАК Номер,
		|	Заказы.Дата КАК Дата,
		|	Заказы.Проведен КАК Проведен,
		|	Заказы.АдресДоставки КАК АдресДоставки,
		|	Заказы.Магазин КАК Магазин,
		|	Заказы.Состояние КАК Состояние,
		|	Заказы.Курьер КАК Курьер,
		|	Заказы.Представление КАК Представление,
		|	Заказы.МоментВремени КАК МоментВремени
		|ИЗ
		|	Документ.Заказ КАК Заказы
		|ГДЕ
		|	(Заказы.Состояние = ЗНАЧЕНИЕ(Перечисление.СтадииДоставкиЗаказа.Начат)
		|			ИЛИ Заказы.Состояние = ЗНАЧЕНИЕ(Перечисление.СтадииДоставкиЗаказа.Доставляется)
		|			ИЛИ Заказы.Состояние = ЗНАЧЕНИЕ(Перечисление.СтадииДоставкиЗаказа.Задерживается))
		|	И Заказы.Курьер = &Курьер";	
	Запрос.УстановитьПараметр("Курьер", Курьер);
	ЕстьЗаказ = НЕ Запрос.Выполнить().Пустой();	
	Возврат ЕстьЗаказ;
КонецФункции  

    



