Функция ПользовательЕстьВКурьерах() Экспорт
	ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя; 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Курьеры.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Курьеры КАК Курьеры
	|ГДЕ
	|	Курьеры.Наименование = &Наименование";	
	Запрос.УстановитьПараметр("Наименование", ИмяПользователя);
	ЕстьВКурьерах = НЕ Запрос.Выполнить().Пустой();  
	Возврат ЕстьВКурьерах; 
КонецФункции 

Функция ЭтоКурьер() Экспорт
	Возврат РольДоступна("Курьер");
КонецФункции 

Процедура ДобавитьПользователяВКурьеры() Экспорт  
	ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	НовыйКурьер = Справочники.Курьеры.СоздатьЭлемент();
	НовыйКурьер.Наименование = ИмяПользователя;
	НовыйКурьер.ВидКурьера = Перечисления.ВидыКурьеров.Дополнительный; 
	НовыйКурьер.ГотовностьКРаботе = Перечисления.СтатусыГотовностиКурьеровКРаботе.НеГотов;
	НовыйКурьер.Записать();
КонецПроцедуры  

Функция ПолучитьКурьера() Экспорт 
	ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя; 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Курьеры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Курьеры КАК Курьеры
	|ГДЕ
	|	Курьеры.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование", ИмяПользователя);	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
 	ВыборкаДетальныеЗаписи.Следующий();	
	Возврат ВыборкаДетальныеЗаписи.Ссылка;
КонецФункции     


Функция ПолучитьСтатусКурьера() Экспорт 
	ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя; 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Курьеры.ГотовностьКРаботе КАК Статус
	|ИЗ
	|	Справочник.Курьеры КАК Курьеры
	|ГДЕ
	|	Курьеры.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование", ИмяПользователя);	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
 	ВыборкаДетальныеЗаписи.Следующий();	
	Возврат ВыборкаДетальныеЗаписи.Статус;
КонецФункции

