Процедура ПодборКурьеровКЗаказу() Экспорт 
	// заявки по стадиям: основные, готовые с приоритетом, готовые, отменить заказ
	// между стадиями - по n минут  
	// только для заказов, у которых не подобран курьер
	
	
	//МенеджерЗаписи = РегистрыСведений.ОТЛАДКА.СоздатьМенеджерЗаписи();
	//МенеджерЗаписи.ТекДата = ТекущаяДата();
	//МенеджерЗаписи.Текст = "ОПА";
	//МенеджерЗаписи.Записать(); 	
КонецПроцедуры

Процедура КонтрольОпаздывающихКурьеров() Экспорт  
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Заказы.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Заказ КАК Заказы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПодборКурьераКЗаказу.СрезПоследних КАК ПодборКурьераКЗаказуСрезПоследних
		|		ПО Заказы.Ссылка = ПодборКурьераКЗаказуСрезПоследних.Заказ
		|ГДЕ
		|	ПодборКурьераКЗаказуСрезПоследних.ОтветКурьера = ЗНАЧЕНИЕ(Перечисление.СтатусыПодбораКурьераКЗаказу.БеруВРаботу)
		|	И Заказы.Состояние = ЗНАЧЕНИЕ(Перечисление.СтадииДоставкиЗаказа.Начат)
		|	И РАЗНОСТЬДАТ(ПодборКурьераКЗаказуСрезПоследних.Период, &ТекущееВремя, МИНУТА) >= 60";
	Запрос.УстановитьПараметр("ТекущееВремя", ТекущаяДата());
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаказСсылка = ВыборкаДетальныеЗаписи.Ссылка;
		ЗаказОбъект = ЗаказСсылка.ПолучитьОбъект();
		ЗаказОбъект.Состояние = Перечисления.СтадииДоставкиЗаказа.Задерживается;
		ЗаказОбъект.Записать();
	КонецЦикла;
КонецПроцедуры  






