
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если МенеджерКурьеров.ЭтоКурьер() И ВидФормы = "ФормаОбъекта" Тогда 
		ВыбраннаяФорма = "Документ.Заказ.Форма.КурьерскаяФормаДокумента";
		СтандартнаяОбработка = Ложь;
		Иначе Если РольДоступна("Менеджер") И ВидФормы = "ФормаОбъекта" Тогда 
			ВыбраннаяФорма = "Документ.Заказ.Форма.МенеджерскаяФормаДокумента";
			СтандартнаяОбработка = Ложь;	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
