
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если МенеджерКурьеров.ЭтоКурьер() Тогда 
		ТекущийКурьер = МенеджерКурьеров.ПолучитьКурьера();
		Если ВидФормы = "ФормаОбъекта" Тогда
			Если МенеджерЗаказов.ЕстьЗаказВРаботе(ТекущийКурьер) Тогда 
				ВыбраннаяФорма = "Документ.Заказ.Форма.КурьерскаяФормаДокументаДляДоставок";	
			Иначе
				ВыбраннаяФорма = "Документ.Заказ.Форма.КурьерскаяФормаДокументаДляЗаявок";
			КонецЕсли;
		КонецЕсли;
		Если ВидФормы = "ФормаСписка" Тогда 
			Если МенеджерЗаказов.ЕстьЗаказВРаботе(ТекущийКурьер) Тогда
				ВыбраннаяФорма = "Документ.Заказ.Форма.КурьерскаяФормаСпискаДляДоставок";
			Иначе
				ВыбраннаяФорма = "Документ.Заказ.Форма.КурьерскаяФормаСпискаДляЗаявок";
			КонецЕсли;
		КонецЕсли; 
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры
